       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX03.
       AUTHOR. ANDERSON.
       DATE-WRITTEN. 18/04/2022.
       SECURITY. DONT TOUCH.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PC.
       OBJECT-COMPUTER. PC.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELSAI ASSIGN TO DISK.
       DATA DIVISION.
       FILE SECTION.
       FD CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01 REG-ENT.
           02 CODIGOIN PIC 9(07).
           02 NOMEIN PIC X(30).
           02 SALARIOIN PIC 9(05)V9(02).
           02 SEXOIN PIC X(01).
       FD RELSAI
           LABEL RECORD IS OMITTED.

       01 REL-ATR PIC X(80).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC X(03) VALUE "NAO".
       77 CT-LIN PIC 9(02) VALUE 21.
       77 CT-PAG PIC 9(02) VALUE ZEROES.
       77 TOTALCLIENTE PIC 9(05) VALUE ZEROES.
       77 TOTALSALARIO PIC 9(09)V9(02).

       01 CAB01.
           02 FILLER PIC X(69) VALUE SPACES.
           02 FILLER PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC 999.
           02 FILLER PIC X(03) VALUE SPACES.

       01 CAB02.
           02 FILLER PIC X(21) VALUE SPACES.
           02 FILLER PIC X(38)
               VALUE "LISTAGEM DOS CLIENTES DO SEXO FEMININO".
           02 FILLER PIC X(21) VALUE SPACES.

       01 CAB03.
           02 FILLER PIC X(23) VALUE SPACES.
           02 FILLER PIC X(34)
               VALUE "COM SALARIOS SUPERIORES A 5000,00".
           02 FILLER PIC X(23) VALUE SPACES.

       01 CAB04.
           02 FILLER PIC X(05) VALUE SPACES.
           02 FILLER  PIC X(06) VALUE "CODIGO".
           02 FILLER PIC X(16) VALUE SPACES.
           02 FILLER PIC X(04) VALUE "NOME".
           02 FILLER PIC X(34) VALUE SPACES.
           02 FILLER PIC X(07) VALUE "SALARIO".
           02 FILLER PIC X(08) VALUE SPACES.

       01 CAB05.
           02 FILLER PIC X(05) VALUE SPACES.
           02 FILLER PIC X(28) VALUE "Total de clientes impressos:".
           02 FILLER PIC X(05) VALUE SPACES.
           02 TOTAL-CLIENTE PIC ZZ.999.
           02 FILLER PIC X(36) VALUE SPACES.

       01 CAB06.
           02 FILLER PIC X(05) VALUE SPACES.
           02 FILLER PIC X(17) VALUE "TOTAL de Salario:".
           02 FILLER PIC X(08) VALUE SPACES.
           02 TOTAL-SALARIO PIC ZZZ.ZZZ.ZZ9,99.
           02 FILLER PIC X(36) VALUE SPACES.

       01 DETALHE.
          02 FILLER      PIC X(05) VALUE SPACES.
          02 CODIGO  PIC 9(07).
          02 FILLER      PIC X(11) VALUE SPACES.
          02 NOME    PIC X(30).
          02 FILLER      PIC X(11) VALUE SPACES.
          02 SALARIO PIC ZZ.999,99.
          02 FILLER      PIC X(07) VALUE SPACES.
       PROCEDURE DIVISION.

       EX03-TESTE.

       PERFORM INICIO.
       PERFORM PRINCIPAL UNTIL FIM-ARQ EQUALS "SIM".
       PERFORM CABECALHOFINAL.
       PERFORM TERMINO.
       STOP RUN.

       INICIO. 
           OPEN INPUT CADENT OUTPUT RELSAI.
           PERFORM LEITURA.
       LEITURA.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.
       IMPRESSAO.
           IF CT-LIN > 20
               PERFORM CABECALHO.
           PERFORM IMPREDET.

       PRINCIPAL.
           IF (SEXOIN EQUAL "F" OR SEXOIN EQUAL "f") AND
              (SALARIOIN NOT< 5000)
              PERFORM IMPRESSAO.
           PERFORM LEITURA.
       IMPREDET.
           MOVE NOMEIN TO NOME.
           MOVE CODIGOIN TO CODIGO.
           MOVE SALARIOIN TO SALARIO.
           WRITE REL-ATR FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CT-LIN.
           ADD 1 TO TOTALCLIENTE.
           ADD SALARIOIN TO TOTALSALARIO.
       CABECALHO.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REL-ATR.
           WRITE REL-ATR FROM CAB01 AFTER ADVANCING 1 LINE.
           WRITE REL-ATR FROM CAB02 AFTER ADVANCING 1 LINE.
           WRITE REL-ATR FROM CAB03 AFTER ADVANCING 1 LINE.
           WRITE REL-ATR FROM CAB04 AFTER ADVANCING 3 LINES.
           MOVE SPACES TO REL-ATR.
           WRITE REL-ATR AFTER ADVANCING 1 LINE.
           MOVE 1 TO CT-LIN.
 
       CABECALHOFINAL.
           MOVE TOTALCLIENTE TO TOTAL-CLIENTE.
           MOVE TOTALSALARIO TO TOTAL-SALARIO.
           WRITE REL-ATR FROM CAB05 AFTER ADVANCING 2 LINES.
           WRITE REL-ATR FROM CAB06 AFTER ADVANCING 1 LINE.

       TERMINO.
           CLOSE CADENT RELSAI.
          
           

          